app/views/articles/_form.html.erb

    <%= f.label "Category" %><br>
    <%= f.select :category_ids, Category.all.collect {|c| [c.name, c.id]}, {}, { multiple: true } %>
---
SELECT "categories".* FROM "categories"