app/views/articles/show.html.erb

  <div id="comments">
    <% @article.sub_articles.each do |sub|%>
---
SELECT "sub_articles".* FROM "sub_articles" WHERE "sub_articles"."article_id" = ?  [["article_id", 1]]