app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.all.page(params[:page]).per(1)

INSERT INTO "articles" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Title"], ["content", "Test test test test test"], ["user_id", 1], ["created_at", "2015-06-16 15:37:33.597160"], ["updated_at", "2015-06-16 15:37:33.597160"]]
---
  def create
    @article = current_user.articles.new(article_params)
    respond_to do |format|

      if @article.save

SELECT "sub_articles".* FROM "sub_articles" WHERE "sub_articles"."article_id" = ?  [["article_id", 1]]
---
    def set_article
      @article = Article.find(params[:id])